thumb2/nrf51sdk12_3/components/libraries/bootloader/ble_dfu/nrf_ble_dfu.c
static uint32_t response_send(ble_dfu_t          * p_dfu,
                              uint8_t              op_code,
                              nrf_dfu_res_code_t   resp_val)
{
    uint16_t index = 0;

    NRF_LOG_INFO("Sending Response: [0x%01x, 0x%01x]\r\n", op_code, resp_val);

#ifndef NRF51
    if (p_dfu == NULL) {
        return NRF_ERROR_NULL;
    }
#endif

    if ((m_conn_handle == BLE_CONN_HANDLE_INVALID) || (m_flags & DFU_BLE_FLAG_SERVICE_INITIALIZED) == 0) {
        return NRF_ERROR_INVALID_STATE;
    }

    m_notif_buffer[index++] = BLE_DFU_OP_CODE_RESPONSE;

    // Encode the Request Op code
    m_notif_buffer[index++] = op_code;

    // Encode the Response Value.
    m_notif_buffer[index++] = (uint8_t)resp_val;

    return send_hvx(m_conn_handle, p_dfu->dfu_ctrl_pt_handles.value_handle, index);
}


static uint32_t response_crc_cmd_send(ble_dfu_t         * p_dfu,
                                      uint32_t            offset,
                                      uint32_t            crc)
{
    uint16_t               index = 0;

    NRF_LOG_INFO("Sending CRC: [0x60, 0x03, 0x01, 0:x%08x, CRC:0x%08x]\r\n", offset, crc);

#ifndef NRF51
    if (p_dfu == NULL) {
        return NRF_ERROR_NULL;
    }
#endif

    if ((m_conn_handle == BLE_CONN_HANDLE_INVALID) || (m_flags & DFU_BLE_FLAG_SERVICE_INITIALIZED) == 0) {
        return NRF_ERROR_INVALID_STATE;
    }

    m_notif_buffer[index++] = BLE_DFU_OP_CODE_RESPONSE;

    // Encode the Request Op code
    m_notif_buffer[index++] = BLE_DFU_OP_CODE_CALCULATE_CRC;

    // Encode the Response Value.
    m_notif_buffer[index++] = (uint8_t)NRF_DFU_RES_CODE_SUCCESS;

    // Encode the Offset Value.
    index += uint32_encode(offset, &m_notif_buffer[index]);

    // Encode the Crc Value.
    index += uint32_encode(crc, &m_notif_buffer[index]);

    return send_hvx(m_conn_handle, p_dfu->dfu_ctrl_pt_handles.value_handle, index);
}


static uint32_t response_select_object_cmd_send(ble_dfu_t         * p_dfu,
        uint32_t            max_size,
        uint32_t            offset,
        uint32_t            crc)
{
    uint16_t               index = 0;

    NRF_LOG_INFO("Sending Object Info: [0x60, 0x06, 0x01 max: 0:x%08x 0:x%08x, CRC:0x%08x]\r\n", max_size, offset, crc);
#ifndef NRF51
    if (p_dfu == NULL) {
        return NRF_ERROR_NULL;
    }
#endif

    if ((m_conn_handle == BLE_CONN_HANDLE_INVALID) || (m_flags & DFU_BLE_FLAG_SERVICE_INITIALIZED) == 0) {
        return NRF_ERROR_INVALID_STATE;
    }

    m_notif_buffer[index++] = BLE_DFU_OP_CODE_RESPONSE;

    // Encode the Request Op code
    m_notif_buffer[index++] = BLE_DFU_OP_CODE_SELECT_OBJECT;

    // Encode the Success Response Value.
    m_notif_buffer[index++] = (uint8_t)NRF_DFU_RES_CODE_SUCCESS;

    // Encode the Max Size Value.
    index += uint32_encode(max_size, &m_notif_buffer[index]);

    // Encode the Offset Value.
    index += uint32_encode(offset, &m_notif_buffer[index]);

    // Encode the Crc Value.
    index += uint32_encode(crc, &m_notif_buffer[index]);

    return send_hvx(m_conn_handle, p_dfu->dfu_ctrl_pt_handles.value_handle, index);
}


/**@brief     Function for handling a Write event on the Control Point characteristic.
 *
 * @param[in] p_dfu             DFU Service Structure.
 * @param[in] p_ble_write_evt   Pointer to the write event received from BLE stack.
 *
 * @return    NRF_SUCCESS on successful processing of control point write. Otherwise an error code.
 */
static uint32_t on_ctrl_pt_write(ble_dfu_t * p_dfu, ble_gatts_evt_write_t * p_ble_write_evt)
{
    nrf_dfu_res_code_t  res_code;
    nrf_dfu_req_t       dfu_req;
    nrf_dfu_res_t       dfu_res = {{{0}}};

    memset(&dfu_req, 0, sizeof(nrf_dfu_req_t));

    switch (p_ble_write_evt->data[0]) {
    case BLE_DFU_OP_CODE_CREATE_OBJECT:

        if (p_ble_write_evt->len != PKT_CREATE_PARAM_LEN) {
            return response_send(p_dfu,
                                 BLE_DFU_OP_CODE_CREATE_OBJECT,
                                 NRF_DFU_RES_CODE_INVALID_PARAMETER);
        }

        NRF_LOG_INFO("Received create object\r\n");

        // Reset the packet receipt notification on create object
        m_pkt_notif_target_cnt = m_pkt_notif_target;

        // Get type parameter
        //lint -save -e415
        dfu_req.obj_type    =  p_ble_write_evt->data[1];
        //lint -restore

        // Get length value
        //lint -save -e416
        dfu_req.object_size = uint32_decode(&(p_ble_write_evt->data[2]));
        //lint -restore

        // Set req type
        dfu_req.req_type        = NRF_DFU_OBJECT_OP_CREATE;

        res_code = nrf_dfu_req_handler_on_req(NULL, &dfu_req, &dfu_res);
        return response_send(p_dfu, BLE_DFU_OP_CODE_CREATE_OBJECT, res_code);

    case BLE_DFU_OP_CODE_EXECUTE_OBJECT:
        NRF_LOG_INFO("Received execute object\r\n");

        // Set req type
        dfu_req.req_type     =  NRF_DFU_OBJECT_OP_EXECUTE;

        res_code = nrf_dfu_req_handler_on_req(NULL, &dfu_req, &dfu_res);
        return response_send(p_dfu, BLE_DFU_OP_CODE_EXECUTE_OBJECT, res_code);

    case BLE_DFU_OP_CODE_SET_RECEIPT_NOTIF:
        NRF_LOG_INFO("Set receipt notif\r\n");
        if (p_ble_write_evt->len != PKT_SET_PRN_PARAM_LEN) {
            return (response_send(p_dfu,
                                  BLE_DFU_OP_CODE_SET_RECEIPT_NOTIF,
                                  NRF_DFU_RES_CODE_INVALID_PARAMETER));
        }

        //lint -save -e415
        m_pkt_notif_target = uint16_decode(&(p_ble_write_evt->data[1]));
        //lint -restore
        m_pkt_notif_target_cnt   = m_pkt_notif_target;

        return response_send(p_dfu, BLE_DFU_OP_CODE_SET_RECEIPT_NOTIF, NRF_DFU_RES_CODE_SUCCESS);

    case BLE_DFU_OP_CODE_CALCULATE_CRC:
        NRF_LOG_INFO("Received calculate CRC\r\n");

        dfu_req.req_type     =  NRF_DFU_OBJECT_OP_CRC;

        res_code = nrf_dfu_req_handler_on_req(NULL, &dfu_req, &dfu_res);
        if (res_code == NRF_DFU_RES_CODE_SUCCESS) {
            return response_crc_cmd_send(p_dfu, dfu_res.offset, dfu_res.crc);
        } else {
            return response_send(p_dfu, BLE_DFU_OP_CODE_CALCULATE_CRC, res_code);
        }

    case BLE_DFU_OP_CODE_SELECT_OBJECT:

        NRF_LOG_INFO("Received select object\r\n");
        if (p_ble_write_evt->len != PKT_READ_OBJECT_INFO_PARAM_LEN) {
            return response_send(p_dfu,
                                 BLE_DFU_OP_CODE_SELECT_OBJECT,
                                 NRF_DFU_RES_CODE_INVALID_PARAMETER);
        }

